{
	"title": "My Story",
	"title1": "Begin of My Journey",
	"description1": "After graduated from my university, I found my first job as a programmer in May 2017. I worked at a startup software house company; Newgate Software Sdn. Bhd. I was assigned to work on an e-commerce project that will be launch in China. We used the Java spring boot framework to implement the backend API system and Angular2 for the Admin portal. I learned a lot of stuff by myself (e.g: MVC structure, FE framework, async await) because there's no senior at that time. During the development phase, I was a bit frustrated at that time because the whole company is structureless (No DLCS what so ever). Everyone just randomly doing their things without communicate with each other. Even though I didn't regret joining this company but It was definitely a bad decision by me.",
	"title2": "Understanding Networking",
	"description2": "At the end of May, I decided to leave my company because of lack of management in that company. I found an in-house software company for my next job. It's a DataCenter Infrastructure Management System company; Ekova System Sdn. Bhd. In this company, I was in charge to enhance the existing system as well as implement a new feature to it. Besides, I also developed a mobile application for the system by using existing API using the IONIC framework. A friendly colleague of mine taught me a lot about network knowledge (public IP, local IP, VPN, domain, etc.) and I start to create my portfolio website and a CMS (not this one) and host it myself in a rented VPS.",
	"title3": "Technical just isn't enough",
	"description3": "At the beginning of June 2019, I again decided to leave my company because I thought that I haven't got any experience working in a big company. I want to know how big a company runs its operation to deliver the product effectively. I joined Binary Sdn. Bhd.; A trading platform company and I started to work with a group of talented people. I learned a lot of technical knowledge that I haven't got a chance to discover in my previous job. For example: `lerna monorepo`, `Blockly`, `Git`, `svg image/icon`. However, there's also the downside of joining a big company. A meeting in a day is minimal; Sometimes, there will be 3 or 4 meetings per day. Sitting down coding for a day is nearly impossible. Other than that, I realize working in a big company hardworking just isn't enough. You need to learn how to present your work to your HOD and most importantly present yourself.",
	"title4": "Work-life Balance",
	"description4": "At year 2020, I have been switching a few company because I was looking for company that give good life balance and have good compensation at the same time because I know I'm underpay as a programmer. This isn't mean that I'm laying off and just doing programming for the sake of money. I want to work on things I love and worry less about my wallet. lol",
	"title5": "Web3",
	"description5": "At year 2022, raised of popularity in Web3 has caught my attention and I started to look into it. I have build interest in this field and truly believe that Web3 is the future in financial field. I joined Mercurial and help in their frontend development using NextJS, Solana Web3 API and Serum anchor API.",
	"title6": "Journey Continue",
	"description6": "I'm glad and grateful that I found a job that i love. Even though working as a Software Developer needs to be extremely hardworking to keep up-to-date with the trend but anyhow I'm passionate about programming and can't wait to explore further about it."
}
